DataProcessors/ПубликацияРасчетныхЛистковКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ПубликацияРасчетныхЛистковКабинетСотрудника</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцОпубликованных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОпубликованных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛицаКПубликации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Публиковать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НастройкиСервисаКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСервисаКабинетСотрудника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Идентификатор информационной системы в сервисе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Наименования информационной системы в сервисе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПриложения</Name>
					<Comment>Идентификатор приложения в сервисе, в котором развернута информационная система</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполнятьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТестовыйТарифАктивирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АбонентСервисаИнициализирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяАктивацияТестовогоТарифа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеОбАктивацииТестовогоТарифаОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СервисЗаблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяОбновитьНастройкиФункциональности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПубликуемыеОбъектыКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПубликуемыеОбъектыКабинетСотрудника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ОбъектПубликации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОшибкиЗаполненияПубликуемыхОбъектовКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОшибкиЗаполненияПубликуемыхОбъектовКабинетСотрудника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕстьОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектПубликации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РасчетныеЛисткиКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РасчетныеЛисткиКабинетСотрудника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СостояниеПубликации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРасчетныхЛистковКабинетСотрудника</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияРасчетныхЛистковКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияРасчетныхЛистковКабинетСотрудника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПубликации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опубликован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОтзыва</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозван</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ПубликацияРасчетныхЛистковКабинетСотрудника/Forms/ПубликацияРасчетныхЛистков/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Организация Месяц МесяцОпубликованных
	ЗначенияДляЗаполнения = Новый Структура("Организация,Месяц", "Объект.Организация", "Объект.Месяц");
	ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
	Если Не ЗначениеЗаполнено(Объект.Месяц) Тогда
		Объект.Месяц = ТекущаяДатаСеанса();
	КонецЕсли;
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтотОбъект, "Объект.Месяц", "МесяцСтрокой");
	
	УстановитьПривилегированныйРежим(Истина);
	Настройки = РегистрыСведений.НастройкиСервисаКабинетСотрудника.НастройкиСервиса();
	Если Не Настройки.АбонентСервисаИнициализирован Тогда
		КабинетСотрудникаМенеджерСервиса.ИнициализироватьАбонентаСервиса();
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	НачальноеЗаполнение();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.Месяц", "МесяцСтрокой");
	ОбновитьСписокКПубликации();
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("МесяцНачалоВыбораЗавершение", ЭтотОбъект);
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.Месяц", "МесяцСтрокой", Ложь, Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт
	ОбновитьСписокКПубликации();
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Объект.Месяц", "МесяцСтрокой", Направление);
	ПодключитьОбработчикОжидания("ОбработчикОжиданияМесяцПриРегулировании", 0.3, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияМесяцПриРегулировании()
	ОбновитьСписокКПубликации();
КонецПроцедуры

&НаКлиенте
Процедура МесяцАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МесяцОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МесяцОпубликованногоПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.МесяцОпубликованных", "МесяцОпубликованногоСтрокой");
	ОбновитьСписокОпубликованных();
КонецПроцедуры

&НаКлиенте
Процедура МесяцОпубликованногоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("МесяцОпубликованногоНачалоВыбораЗавершение", ЭтотОбъект);
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.МесяцОпубликованных", "МесяцОпубликованногоСтрокой", Ложь, Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура МесяцОпубликованногоНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт
	ОбновитьСписокОпубликованных();
КонецПроцедуры

&НаКлиенте
Процедура МесяцОпубликованногоРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Объект.МесяцОпубликованных", "МесяцОпубликованногоСтрокой", Направление);
	ПодключитьОбработчикОжидания("ОбработчикОжиданияМесяцОпубликованногоПриРегулировании", 0.3, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияМесяцОпубликованногоПриРегулировании()
	ОбновитьСписокОпубликованных();
КонецПроцедуры

&НаКлиенте
Процедура МесяцОпубликованногоАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МесяцОпубликованногоОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбновитьСписокКПубликации();
	ОбновитьСписокОпубликованных();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ОбновитьСписокКПубликации();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОпубликованногоПриИзменении(Элемент)
	ОбновитьСписокОпубликованных();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФизическиеЛицаКПубликации

&НаКлиенте
Процедура ФизическиеЛицаКПубликацииПубликуетсяПриИзменении(Элемент)
	
	ПубликуемыеСтроки = Объект.ФизическиеЛицаКПубликации.НайтиСтроки(Новый Структура("Публиковать", Истина));
	ЗаголовокНадписьКПубликации(Элементы, ПубликуемыеСтроки.Количество());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Опубликовать(Команда)
	
	Если СервисЗаблокирован() Тогда
		ТекстСообщения = КабинетСотрудникаКлиент.ТекстСообщенияОБлокировкеСервиса();
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если Не ОрганизацияЗаполнена() Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ОпубликоватьНаСервере();
	Если ЗначениеЗаполнено(ДлительнаяОперация) Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
		ПараметрыОжидания.ОповещениеПользователя.Текст = НСтр("ru = 'Выгрузка прошла успешно.'");
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьНаКлиентеПубликацию", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОпубликоватьПовторно(Команда)
	
	Если СервисЗаблокирован() Тогда
		ТекстСообщения = КабинетСотрудникаКлиент.ТекстСообщенияОБлокировкеСервиса();
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если Не ОрганизацияЗаполнена() Тогда
		Возврат;
	КонецЕсли;
	
	СписокФизическихЛиц = Новый Массив;
	Для Каждого ВыбраннаяСтрока Из Элементы.Опубликованные.ВыделенныеСтроки Цикл
		СписокФизическихЛиц.Добавить(Элементы.Опубликованные.ДанныеСтроки(ВыбраннаяСтрока).ФизическоеЛицо);
	КонецЦикла;
	Если СписокФизическихЛиц.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	ДлительнаяОперация = ОпубликоватьПовторноНаСерве(СписокФизическихЛиц);
	Если ЗначениеЗаполнено(ДлительнаяОперация) Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
		ПараметрыОжидания.ОповещениеПользователя.Текст = НСтр("ru = 'Выгрузка прошла успешно.'");
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьНаКлиентеПубликацию", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпубликоватьПовторноВсе(Команда)
	
	Если СервисЗаблокирован() Тогда
		ТекстСообщения = КабинетСотрудникаКлиент.ТекстСообщенияОБлокировкеСервиса();
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если Не ОрганизацияЗаполнена() Тогда
		Возврат;
	КонецЕсли;
	
	СписокФизическихЛиц = ФизическиеЛицаСОпубликованнымиЛистками();
	Если СписокФизическихЛиц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ОпубликоватьПовторноНаСерве(СписокФизическихЛиц);
	Если ЗначениеЗаполнено(ДлительнаяОперация) Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
		ПараметрыОжидания.ОповещениеПользователя.Текст = НСтр("ru = 'Выгрузка прошла успешно.'");
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьНаКлиентеПубликацию", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для каждого СтрокаТЧ Из Объект.ФизическиеЛицаКПубликации Цикл
		СтрокаТЧ.Публиковать = Истина;
	КонецЦикла;
	
	ЗаголовокНадписьКПубликации(Элементы, Объект.ФизическиеЛицаКПубликации.Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для каждого СтрокаТЧ Из Объект.ФизическиеЛицаКПубликации Цикл
		СтрокаТЧ.Публиковать = Ложь;
	КонецЦикла;
	
	ЗаголовокНадписьКПубликации(Элементы, 0);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокКПубликации(ОбновитьСписокПубликации = Ложь);
	
	НеПубликуемые = Новый Соответствие;
	Если ОбновитьСписокПубликации Тогда
		Для каждого СтрокаТЧ Из Объект.ФизическиеЛицаКПубликации Цикл
			Если Не СтрокаТЧ.Публиковать Тогда
				НеПубликуемые.Вставить(СтрокаТЧ.ФизическоеЛицо, Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Объект.ФизическиеЛицаКПубликации.Очистить();
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
		ПараметрыПолученияСотрудников.Организация = Объект.Организация;
		ПараметрыПолученияСотрудников.Подразделение = Объект.Подразделение;
		ПараметрыПолученияСотрудников.НачалоПериода = Объект.Месяц;
		ПараметрыПолученияСотрудников.ОкончаниеПериода = КонецМесяца(Объект.Месяц);
		ПараметрыПолученияСотрудников.КадровыеДанные = "Организация";
		КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудников);
		
		СостоянияПубликации = Новый Массив;
		СостоянияПубликации.Добавить(Перечисления.СостоянияРасчетныхЛистковКабинетСотрудника.Опубликован);
		СостоянияПубликации.Добавить(Перечисления.СостоянияРасчетныхЛистковКабинетСотрудника.ОжидаетПубликации);
		Запрос.УстановитьПараметр("СостоянияПубликации", СостоянияПубликации);
		Запрос.УстановитьПараметр("МесяцПубликации", Объект.Месяц);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТСотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизическиеЛица
		|ИЗ
		|	ВТСотрудникиОрганизации КАК ВТСотрудникиОрганизации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПубликуемыеОбъектыКабинетСотрудника КАК ПубликуемыеОбъектыКабинетСотрудника
		|		ПО ВТСотрудникиОрганизации.Сотрудник = ПубликуемыеОбъектыКабинетСотрудника.ОбъектПубликации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОшибкиЗаполненияПубликуемыхОбъектовКабинетСотрудника КАК ОшибкиЗаполнения
		|		ПО ВТСотрудникиОрганизации.ФизическоеЛицо = ОшибкиЗаполнения.ОбъектПубликации
		|ГДЕ
		|	НЕ ЕСТЬNULL(ОшибкиЗаполнения.ЕстьОшибки, ЛОЖЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИСТИНА КАК Публиковать
		|ИЗ
		|	ВТФизическиеЛица КАК ТаблицаФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО ТаблицаФизическиеЛица.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасчетныеЛисткиКабинетСотрудника КАК РасчетныеЛисткиКабинетСотрудника
		|		ПО ТаблицаФизическиеЛица.ФизическоеЛицо = РасчетныеЛисткиКабинетСотрудника.ФизическоеЛицо
		|			И (РасчетныеЛисткиКабинетСотрудника.Организация = &Организация)
		|			И (РасчетныеЛисткиКабинетСотрудника.Месяц = &МесяцПубликации)
		|			И (РасчетныеЛисткиКабинетСотрудника.СостояниеПубликации В (&СостоянияПубликации))
		|ГДЕ
		|	РасчетныеЛисткиКабинетСотрудника.ФизическоеЛицо ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическиеЛица.Наименование";
		УстановитьПривилегированныйРежим(Истина);
		// Привилегированный режим допустим, т.к. ВТСотрудникиОрганизации содержит только разрешенные данные.
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект.ФизическиеЛицаКПубликации.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			Если ОбновитьСписокПубликации Тогда
				Если НеПубликуемые[НоваяСтрока.ФизическоеЛицо] <> Неопределено Тогда
					НоваяСтрока.Публиковать = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ПубликуемыеСтроки = Объект.ФизическиеЛицаКПубликации.НайтиСтроки(Новый Структура("Публиковать", Истина));
	ЗаголовокНадписьКПубликации(Элементы, ПубликуемыеСтроки.Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокОпубликованных();
	ОбновитьСписокОпубликованныхНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокОпубликованныхНаСервере()
	
	СостоянияПубликации = Новый Массив;
	СостоянияПубликации.Добавить(Перечисления.СостоянияРасчетныхЛистковКабинетСотрудника.Опубликован);
	СостоянияПубликации.Добавить(Перечисления.СостоянияРасчетныхЛистковКабинетСотрудника.ОжидаетПубликации);
	
	ПараметрыЗапроса = Новый Структура("Организация,Месяц,СостоянияОпубликованы,ФизическиеЛица,ВсеФизическиеЛица");
	ПараметрыЗапроса.Организация 			= Объект.Организация;
	ПараметрыЗапроса.Месяц 					= Объект.МесяцОпубликованных;
	ПараметрыЗапроса.СостоянияОпубликованы 	= СостоянияПубликации;
	ПараметрыЗапроса.ФизическиеЛица 		= Новый Массив;
	ПараметрыЗапроса.ВсеФизическиеЛица 		= Ложь;
	
	Если ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.ПодразделениеОпубликованных) Тогда
		
		ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
		ПараметрыПолученияСотрудников.Организация = Объект.Организация;
		ПараметрыПолученияСотрудников.Подразделение = Объект.ПодразделениеОпубликованных;
		ПараметрыПолученияСотрудников.НачалоПериода = Объект.МесяцОпубликованных;
		ПараметрыПолученияСотрудников.ОкончаниеПериода = КонецМесяца(Объект.МесяцОпубликованных);
		
		СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолученияСотрудников);
		ПараметрыЗапроса.ФизическиеЛица = ОбщегоНазначения.ВыгрузитьКолонку(СотрудникиОрганизации, "ФизическоеЛицо", Истина);
		
	Иначе
		ПараметрыЗапроса.ВсеФизическиеЛица = Истина;
	КонецЕсли;
	
	ОпубликованныеРасчетныеЛистки.Параметры.УстановитьЗначениеПараметра("Месяц", 					ПараметрыЗапроса.Месяц);
	ОпубликованныеРасчетныеЛистки.Параметры.УстановитьЗначениеПараметра("Организация", 				ПараметрыЗапроса.Организация);
	ОпубликованныеРасчетныеЛистки.Параметры.УстановитьЗначениеПараметра("СостоянияОпубликованы", 	ПараметрыЗапроса.СостоянияОпубликованы);
	ОпубликованныеРасчетныеЛистки.Параметры.УстановитьЗначениеПараметра("ВсеФизическиеЛица", 		ПараметрыЗапроса.ВсеФизическиеЛица);
	ОпубликованныеРасчетныеЛистки.Параметры.УстановитьЗначениеПараметра("ФизическиеЛица", 			ПараметрыЗапроса.ФизическиеЛица);
	
	Запрос = Новый Запрос();
	Для каждого ЭлементКоллекции Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ЭлементКоллекции.Ключ, ЭлементКоллекции.Значение);
	КонецЦикла;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РасчетныеЛисткиКабинетСотрудника.ДатаПубликации) КАК Количество
	|ИЗ
	|	РегистрСведений.РасчетныеЛисткиКабинетСотрудника КАК РасчетныеЛисткиКабинетСотрудника
	|ГДЕ
	|	РасчетныеЛисткиКабинетСотрудника.Организация = &Организация
	|	И РасчетныеЛисткиКабинетСотрудника.Месяц = &Месяц
	|	И РасчетныеЛисткиКабинетСотрудника.СостояниеПубликации В(&СостоянияОпубликованы)
	|	И (&ВсеФизическиеЛица
	|			ИЛИ РасчетныеЛисткиКабинетСотрудника.ФизическоеЛицо В (&ФизическиеЛица))";
	РезультатЗапроса = Запрос.Выполнить();
	КоличествоОпубликованных = 0;
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		КоличествоОпубликованных = Выборка.Количество;
	КонецЕсли;
	
	Элементы.НадписьОпубликованныеКПубликации.Заголовок = СтрШаблон(НСтр("ru = 'Опубликовано расчетных листков: %1'"), КоличествоОпубликованных);
	
КонецПроцедуры

&НаСервере
Функция ОпубликоватьНаСервере()
	
	СписокФизическихЛиц = Новый Массив;
	Для каждого СтрокаТЧ Из Объект.ФизическиеЛицаКПубликации Цикл
		Если СтрокаТЧ.Публиковать Тогда
			СписокФизическихЛиц.Добавить(СтрокаТЧ.ФизическоеЛицо);
		КонецЕсли;
	КонецЦикла;
	Если СписокФизическихЛиц.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыПубликации = Новый Структура;
	ПараметрыПубликации.Вставить("МесяцРасчетныхЛистов", Объект.Месяц);
	ПараметрыПубликации.Вставить("Организация", Объект.Организация);
	ПараметрыПубликации.Вставить("СписокФизическихЛиц", СписокФизическихЛиц);
	ПараметрыПубликации.Вставить("ПовторнаяПубликация", Ложь);
	
	ДлительнаяОперация = Неопределено;
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.Вставить("НаименованиеФоновогоЗадания",
		СтрШаблон(НСтр("ru = 'Выгрузка расчетных листов в 1С:Кабинет сотрудника'")));
	ПараметрыВыполненияВФоне.ОжидатьЗавершение = 0;
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"КабинетСотрудника.ОпубликоватьРасчетныеЛистыВФоне",
		ПараметрыПубликации,
		ПараметрыВыполненияВФоне);
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаСервере
Функция ОпубликоватьПовторноНаСерве(СписокФизическихЛиц)

	ПараметрыПубликации = Новый Структура;
	ПараметрыПубликации.Вставить("МесяцРасчетныхЛистов", Объект.МесяцОпубликованных);
	ПараметрыПубликации.Вставить("Организация", Объект.Организация);
	ПараметрыПубликации.Вставить("СписокФизическихЛиц", СписокФизическихЛиц);
	ПараметрыПубликации.Вставить("ПовторнаяПубликация", Истина);
	
	ДлительнаяОперация = Неопределено;
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.Вставить("НаименованиеФоновогоЗадания",
		СтрШаблон(НСтр("ru = 'Выгрузка расчетных листов в 1С:Кабинет сотрудника'")));
	ПараметрыВыполненияВФоне.ОжидатьЗавершение = 0;
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"КабинетСотрудника.ОпубликоватьРасчетныеЛистыВФоне",
		ПараметрыПубликации,
		ПараметрыВыполненияВФоне);
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьНаКлиентеПубликацию(ДлительнаяОперация, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ДлительнаяОперация) Тогда
		Если ДлительнаяОперация.Статус = "Ошибка" Тогда
			ПоказатьПредупреждение(, ДлительнаяОперация.КраткоеПредставлениеОшибки);
			Возврат;
		Иначе
			НачальноеЗаполнение(Истина);
			ТекстСообщения = НСтр("ru = 'Публикация расчетных листков выполнена.'");
			ПоказатьПредупреждение(, ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НачальноеЗаполнение(ОбновитьСписокПубликации = Ложь)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РасчетныеЛисткиКабинетСотрудника.Месяц КАК Месяц
	|ИЗ
	|	РегистрСведений.РасчетныеЛисткиКабинетСотрудника КАК РасчетныеЛисткиКабинетСотрудника
	|
	|УПОРЯДОЧИТЬ ПО
	|	Месяц УБЫВ";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Объект.МесяцОпубликованных = Объект.Месяц;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Объект.МесяцОпубликованных = Выборка.Месяц;
	КонецЕсли;
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтотОбъект, "Объект.МесяцОпубликованных", "МесяцОпубликованногоСтрокой");
	
	ОбновитьСписокКПубликации(ОбновитьСписокПубликации);
	ОбновитьСписокОпубликованныхНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОпубликованныеПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Функция ФизическиеЛицаСОпубликованнымиЛистками()
	
	ФизическиеЛица = Новый Массив;
	Если ЗначениеЗаполнено(Объект.ПодразделениеОпубликованных) Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
		ПараметрыПолученияСотрудников.Организация = Объект.Организация;
		ПараметрыПолученияСотрудников.Подразделение = Объект.ПодразделениеОпубликованных;
		ПараметрыПолученияСотрудников.НачалоПериода = Объект.МесяцОпубликованных;
		ПараметрыПолученияСотрудников.ОкончаниеПериода = КонецМесяца(Объект.МесяцОпубликованных);
		
		СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолученияСотрудников);
		ФизическиеЛица = ОбщегоНазначения.ВыгрузитьКолонку(СотрудникиОрганизации, "ФизическоеЛицо", Истина);
		
		Если ФизическиеЛица.Количество() = 0 Тогда
			Возврат ФизическиеЛица;
		КонецЕсли;
		
	КонецЕсли;
	
	СостоянияПубликации = Новый Массив;
	СостоянияПубликации.Добавить(Перечисления.СостоянияРасчетныхЛистковКабинетСотрудника.Опубликован);
	СостоянияПубликации.Добавить(Перечисления.СостоянияРасчетныхЛистковКабинетСотрудника.ОжидаетПубликации);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Месяц", Объект.МесяцОпубликованных);
	Запрос.УстановитьПараметр("СостоянияОпубликованы", СостоянияПубликации);
	Запрос.УстановитьПараметр("ВсеФизическиеЛица", ФизическиеЛица.Количество() = 0);
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетныеЛисткиКабинетСотрудника.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.РасчетныеЛисткиКабинетСотрудника КАК РасчетныеЛисткиКабинетСотрудника
	|ГДЕ
	|	РасчетныеЛисткиКабинетСотрудника.Организация = &Организация
	|	И РасчетныеЛисткиКабинетСотрудника.Месяц = &Месяц
	|	И РасчетныеЛисткиКабинетСотрудника.СостояниеПубликации В(&СостоянияОпубликованы)
	|	И (&ВсеФизическиеЛица
	|			ИЛИ РасчетныеЛисткиКабинетСотрудника.ФизическоеЛицо В (&ФизическиеЛица))";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	
КонецФункции

&НаКлиенте
Функция ОрганизацияЗаполнена()

	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат Истина;
	Иначе	
		ТекстСообщения = НСтр("ru = 'Поле ""Организация"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Организация");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СервисЗаблокирован()

	Настройки = РегистрыСведений.НастройкиСервисаКабинетСотрудника.НастройкиСервиса();
	Возврат Настройки.СервисЗаблокирован; 

КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаголовокНадписьКПубликации(Элементы, КоличествоКПубликации)
	
	Элементы.НадписьКПубликации.Заголовок  = СтрШаблон(НСтр("ru = 'Количество сотрудников, по которым будут опубликованы расчетные листы: %1'"), КоличествоКПубликации);

КонецПроцедуры

#КонецОбласти
